project-chip/connectedhomeip/examples/platform/efr32/wf200/host_if.cpp
            if (flags & SL_WFX_CONNECT)
            {
#if (CHIP_DEVICE_CONFIG_ENABLE_IPV4)
                wfx_ip_changed_notify(IP_STATUS_FAIL);
                hasNotifiedIPV4 = false;
#endif // CHIP_DEVICE_CONFIG_ENABLE_IPV4
                wfx_ipv6_notify(GET_IPV6_FAIL);
                hasNotifiedIPV6             = false;
                hasNotifiedWifiConnectivity = false;
                EFR32_LOG("WIFI: Connected to AP");
                wifi_extra |= WE_ST_STA_CONN;
                wfx_lwip_set_sta_link_up();
#ifdef SLEEP_ENABLED
                if (!(wfx_get_wifi_state() & SL_WFX_AP_INTERFACE_UP))
                {
                    // Enable the power save
                    sl_wfx_set_power_mode(WFM_PM_MODE_PS, WFM_PM_POLL_UAPSD, BEACON_1);
                    sl_wfx_enable_device_power_save();
                }
#endif // SLEEP_ENABLED
            }

            if (flags & SL_WFX_DISCONNECT)
            {

#if (CHIP_DEVICE_CONFIG_ENABLE_IPV4)
                wfx_ip_changed_notify(IP_STATUS_FAIL);
                hasNotifiedIPV4 = false;
#endif // CHIP_DEVICE_CONFIG_ENABLE_IPV4
                wfx_ipv6_notify(GET_IPV6_FAIL);
                hasNotifiedIPV6             = false;
                hasNotifiedWifiConnectivity = false;
                wifi_extra &= ~WE_ST_STA_CONN;
                wfx_lwip_set_sta_link_down();
            }

#ifdef SL_WFX_CONFIG_SCAN
            if (flags & SL_WFX_SCAN_START)
            {
                /*
                 * Start the Scan
                 */
                sl_wfx_ssid_def_t ssid, *sp;
                uint16_t num_ssid, slen;
                if (scan_ssid)
                {
                    memset(&ssid, 0, sizeof(ssid));
                    slen = strlen(scan_ssid);
                    memcpy(&ssid.ssid[0], scan_ssid, slen);
                    ssid.ssid_length = slen;
                    num_ssid         = 1;
                    sp               = &ssid;
                }
                else
                {
                    num_ssid = 0;
                    sp       = (sl_wfx_ssid_def_t *) 0;
                }

                EFR32_LOG("WIFI Scan Paramter set to Active channel time %d, Passive "
                          "Channel Time: %d, Number of prob: %d",
                          ACTIVE_CHANNEL_TIME, PASSIVE_CHANNEL_TIME, NUM_PROBE_REQUEST);
                (void) sl_wfx_set_scan_parameters(ACTIVE_CHANNEL_TIME, PASSIVE_CHANNEL_TIME, NUM_PROBE_REQUEST);
                (void) sl_wfx_send_scan_command(WFM_SCAN_MODE_ACTIVE, CHANNEL_LIST, /* Channel list */
                                                CHANNEL_COUNT,                      /* Scan all chans */
                                                sp, num_ssid, IE_DATA,              /* IE we're looking for */
                                                IE_DATA_LENGTH, BSSID_SCAN);
            }
            if (flags & SL_WFX_SCAN_COMPLETE)
            {
                struct scan_result_holder *hp, *next;

                EFR32_LOG("WIFI: Return %d scan results", scan_count);
                for (hp = scan_save; hp; hp = next)
                {
                    next = hp->next;
                    (*scan_cb)(&hp->scan);
                    vPortFree(hp);
                }
                (*scan_cb)((wfx_wifi_scan_result *) 0);
                scan_save  = (struct scan_result_holder *) 0;
                scan_count = 0;
                if (scan_ssid)
                {
                    vPortFree(scan_ssid);
                    scan_ssid = (char *) 0;
                }
                /* Terminate scan */
                scan_cb = 0;
            }
#endif /* SL_WFX_CONFIG_SCAN */
        }
    }

    /****************************************************************************
     * @fn   static sl_status_t wfx_init(void)
     * @brief
     * Initialize the WF200 used by the two interfaces
     * @param[in]  None
     * @return None
     *****************************************************************************/
    static sl_status_t wfx_init(void)
    {
        /* Initialize the WF200 used by the two interfaces */
        wfx_events_task_start();
        sl_status_t status = sl_wfx_init(&wifiContext);
        EFR32_LOG("FMAC Driver version    %s", FMAC_DRIVER_VERSION_STRING);
        switch (status)
        {
        case SL_STATUS_OK:
            EFR32_LOG("WF200 FW ver:%d.%d.%d [MAC %02x:%02x:%02x-%02x:%02x:%02x]", wifiContext.firmware_major,
                      wifiContext.firmware_minor, wifiContext.firmware_build, wifiContext.mac_addr_0.octet[0],
                      wifiContext.mac_addr_0.octet[1], wifiContext.mac_addr_0.octet[2], wifiContext.mac_addr_0.octet[3],
                      wifiContext.mac_addr_0.octet[4], wifiContext.mac_addr_0.octet[5]);
            EFR32_LOG("WF200 Init OK");

            if (wifiContext.state == SL_WFX_STA_INTERFACE_CONNECTED)
            {
                sl_wfx_send_disconnect_command();
            }

            break;
        case SL_STATUS_WIFI_INVALID_KEY:
            EFR32_LOG("*ERR*WF200: F/W keyset invalid");
            break;
        case SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT:
            EFR32_LOG("*ERR*WF200: F/W download timo");
            break;
        case SL_STATUS_TIMEOUT:
            EFR32_LOG("*ERR*WF200: Poll for value timo");
            break;
        case SL_STATUS_FAIL:
            EFR32_LOG("*ERR*WF200: Error");
            break;
        default:
            EFR32_LOG("*ERR*WF200: Unknown");
        }

        return status;
    }

    /*****************************************************************************
     * @fn  static void wfx_wifi_hw_start(void)
     * @brief
     *   tcp ip, wfx and lwip stack and start dhcp client.
     *
     * @param[in]
     *    not used
     *
     * @return
     *    sl_status_t Shows init succes or error.
     ******************************************************************************/
    static void wfx_wifi_hw_start(void)
    {
        sl_status_t status;

        if (wifi_extra & WE_ST_HW_STARTED)
            return;
        EFR32_LOG("STARTING WF200\n");
        wifi_extra |= WE_ST_HW_STARTED;

