project-chip/connectedhomeip/examples/platform/efr32/wf200/host_if.cpp
        sl_wfx_host_gpio_init();
        if ((status = wfx_init()) == SL_STATUS_OK)
        {
            /* Initialize the LwIP stack */
            EFR32_LOG("WF200:Start LWIP");
            wfx_lwip_start();
            wifiContext.state = SL_WFX_STARTED; /* Really this is a bit mask */
            EFR32_LOG("WF200:ready..");
        }
        else
        {
            EFR32_LOG("*ERR*WF200:init failed");
        }
    }

    /************************************************************************
     * @fn   int32_t wfx_get_ap_info(wfx_wifi_scan_result_t *ap)
     * @brief
     * Get AP info
     * @param[in]  ap: access point
     * @return returns -1
     **************************************************************************/
    int32_t wfx_get_ap_info(wfx_wifi_scan_result_t * ap)
    {
        int32_t signal_strength;
        EFR32_LOG("WIFI:SSID:: %s", &ap_info.ssid[0]);
        memcpy(ap->ssid, ap_info.ssid, sizeof(ap_info.ssid));
        EFR32_LOG("WIFI:Mac addr:: %02x:%02x:%02x:%02x:%02x:%02x",
                    ap_info.bssid[0],
                    ap_info.bssid[1],
                    ap_info.bssid[2],
                    ap_info.bssid[3],
                    ap_info.bssid[4],
                    ap_info.bssid[5]);
        memcpy(ap->bssid, ap_info.bssid, sizeof(ap_info.bssid));
        ap->security = ap_info.security;
        EFR32_LOG("WIFI:security:: %d", ap->security);
        ap->chan = ap_info.chan;
        EFR32_LOG("WIFI:Channel:: to %d", ap->chan);

        sl_status_t status = sl_wfx_get_signal_strength((uint32_t*)&signal_strength);

        if (status == SL_STATUS_OK) 
        {
            EFR32_LOG("status SL_STATUS_OK & signal_strength:: %d", signal_strength);
            ap->rssi = (signal_strength - 220)/2;
            
        }
        return status;
    }

    /************************************************************************
     * @fn   int32_t wfx_get_ap_ext(wfx_wifi_scan_ext_t *extra_info)
     * @brief
     * Get AP extra info
     * @param[in]  extra_info: access point extra information
     * @return returns -1
     **************************************************************************/
    int32_t wfx_get_ap_ext(wfx_wifi_scan_ext_t * extra_info)
    {
        int32_t status;
        status = get_all_counters();
        if (status != SL_STATUS_OK) 
        {
            EFR32_LOG("Failed to get the couters");
        } 
        else
        {
            extra_info->beacon_lost_count = counters->body.count_miss_beacon;
            extra_info->beacon_rx_count   = counters->body.count_rx_beacon;
            extra_info->mcast_rx_count    = counters->body.count_rx_multicast_frames;
            extra_info->mcast_tx_count    = counters->body.count_tx_multicast_frames;
            extra_info->ucast_rx_count    = counters->body.count_rx_packets;
            extra_info->ucast_tx_count    = counters->body.count_tx_packets;
            extra_info->overrun_count     = overrun_count;
        }
        return status;
    }

    sl_status_t get_all_counters(void)
    {
        sl_status_t result;
        uint8_t command_id        = 0x05;
        uint16_t mib_id           = 0x2035;
        sl_wfx_mib_req_t *request = NULL;
        uint32_t request_length   = SL_WFX_ROUND_UP_EVEN(sizeof(sl_wfx_header_mib_t) + sizeof(sl_wfx_mib_req_body_t));

        result = sl_wfx_allocate_command_buffer((sl_wfx_generic_message_t **)&request,
                                                command_id,
                                                SL_WFX_CONTROL_BUFFER,
                                                request_length);

        if(request == NULL)
        {
        }

        request->body.mib_id = mib_id;
        request->header.interface = 0x2;
        request->header.encrypted = 0x0;

        result = sl_wfx_send_request(command_id, (sl_wfx_generic_message_t *)request, request_length);
        SL_WFX_ERROR_CHECK(result);

        result = sl_wfx_host_wait_for_confirmation(command_id, SL_WFX_DEFAULT_REQUEST_TIMEOUT_MS, (void **)&counters);
        SL_WFX_ERROR_CHECK(result);

        EFR32_LOG("%-24s %12s \r\n", "", "Debug Counters Content");
        EFR32_LOG("%-24s %lu\r\n", "rcpi", (unsigned long)counters->body.rcpi);
        PUT_COUNTER(plcp_errors);
        PUT_COUNTER(fcs_errors);
        PUT_COUNTER(tx_packets);
        PUT_COUNTER(rx_packets);
        PUT_COUNTER(rx_packet_errors);
        PUT_COUNTER(rx_decryption_failures);
        PUT_COUNTER(rx_mic_failures);
        PUT_COUNTER(rx_no_key_failures);
        PUT_COUNTER(tx_multicast_frames);
        PUT_COUNTER(tx_frames_success);
        PUT_COUNTER(tx_frame_failures);
        PUT_COUNTER(tx_frames_retried);
        PUT_COUNTER(tx_frames_multi_retried);
        PUT_COUNTER(rx_frame_duplicates);
        PUT_COUNTER(rts_success);
        PUT_COUNTER(rts_failures);
        PUT_COUNTER(ack_failures);
        PUT_COUNTER(rx_multicast_frames);
        PUT_COUNTER(rx_frames_success);
        PUT_COUNTER(rx_cmacicv_errors);
        PUT_COUNTER(rx_cmac_replays);
        PUT_COUNTER(rx_mgmt_ccmp_replays);
        PUT_COUNTER(rx_bipmic_errors);
        PUT_COUNTER(rx_beacon);
        PUT_COUNTER(miss_beacon);


        error_handler:

        if (result == SL_STATUS_TIMEOUT) {
            if (sl_wfx_context->used_buffers > 0) {
                sl_wfx_context->used_buffers--;
            }
        }
        if (request != NULL) {
            sl_wfx_free_command_buffer((sl_wfx_generic_message_t *)request, command_id, SL_WFX_CONTROL_BUFFER);
        }
        
        return result;
    }

    /************************************************************************
     * @fn    int32_t wfx_reset_counts()
     * @brief
     *    reset the count
     * @param[in]  None
     * @return returns -1
     **************************************************************************/
    int32_t wfx_reset_counts()
    {
        /* TODO */
        return -1;
    }

    /*************************************************************************
     * @fn   sl_status_t wfx_wifi_start(void)
     * @brief
     * I think that this is getting called before FreeRTOS threads are ready
     * @param[in] none
     * @return  returns SL_STATUS_OK
     **************************************************************************/
    sl_status_t wfx_wifi_start(void)
    {
        if (wifi_extra & WE_ST_STARTED)
        {
            EFR32_LOG("WIFI: Already started");
            return SL_STATUS_OK;
        }
        wifi_extra |= WE_ST_STARTED;
        wfx_soft_init();
        wfx_wifi_hw_start();

